Craix/OKDO_E1_SPI_TFT/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define SPI_TFT_LCD_RESET_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define SPI_TFT_LCD_RESET_GPIO_PIN_MASK (1U << 27U) /*!<@brief GPIO pin mask */
#define SPI_TFT_LCD_RESET_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define SPI_TFT_LCD_RESET_PIN 27U                   /*!<@brief PORT pin number */
#define SPI_TFT_LCD_RESET_PIN_MASK (1U << 27U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PIO1_26 (number 68), LCD
  @{ */

/* Symbols to be used with GPIO driver */
#define SPI_TFT_LCD_DC_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define SPI_TFT_LCD_DC_GPIO_PIN_MASK (1U << 26U) /*!<@brief GPIO pin mask */
#define SPI_TFT_LCD_DC_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define SPI_TFT_LCD_DC_PIN 26U                   /*!<@brief PORT pin number */
#define SPI_TFT_LCD_DC_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SPI_TFT_LCD(void); /* Function assigned for the Cortex-M33 (Core #0) */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
